ИнКар.Маркетплейсы/src/InformationRegisters/УдалитьМП_АвитоОбъявления/УдалитьМП_АвитоОбъявления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьМП_АвитоОбъявления</name>
  <resources>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>НазваниеОбъявления</name>
    <comment>&lt;Title>Бампер передний Audi A4 MW0218681&lt;/Title></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <comment>&lt;DateBegin>2015-12-24&lt;/DateBegin></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <comment>&lt;DateEnd>2079-08-28&lt;/DateEnd></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПлатногоРазмещения</name>
    <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
    <type>
      <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
    </type>
  </resources>
  <resources>
    <name>ПлатнаяУслуга</name>
    <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
    <type>
      <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
    </type>
  </resources>
  <resources>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Менеджер</name>
    <comment>&lt;ManagerName>Иван Петров-Водкин&lt;/ManagerName></comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерТелефона</name>
    <comment>&lt;ContactPhone>+7 495 777-10-66&lt;/ContactPhone></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <comment>&lt;Address>Россия, Тамбовская область, Моршанск, Лесная улица, 7&lt;/Address></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодкатегорияТовара</name>
    <comment>&lt;TypeId>16-814&lt;/TypeId></comment>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <resources>
    <name>ВидОбъявления</name>
    <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
    <type>
      <types>EnumRef.МП_АвитоВидыОбъявлений</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>&lt;Condition>Новое&lt;/Condition></comment>
    <type>
      <types>EnumRef.МП_АвитоСостояние</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <comment>&lt;Availability>Под заказ&lt;/Availability></comment>
    <type>
      <types>EnumRef.МП_АвитоДоступность</types>
    </type>
  </resources>
  <resources>
    <name>OEM</name>
    <comment>&lt;OEM>84501SC020&lt;/OEM></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусОбъявления</name>
    <comment>Статус объявления на сайте (можно указать несколько значений через запятую)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>URLАдресОбъявления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусРазмещенияНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСтатусОбработкиОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПредварительнойОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторАвито</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/УдалитьМП_АвитоОбъявления/Forms/ФормаСписка/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Список выбора для СтатусРазмещенияНаСайте
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоОбъявления.СтатусРазмещенияНаСайте КАК Статус
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоОбъявления КАК МП_АвитоОбъявления
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.ОтборСтатусРазмещенияНаСайте.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

	// Список выбора для СтатусРазмещенияНаСайте
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МП_АвитоОбъявления.ОбщийСтатусОбработкиОбъявления КАК Статус
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_АвитоОбъявления КАК МП_АвитоОбъявления
				   |УПОРЯДОЧИТЬ ПО
				   |	Статус";
	ТЗНаборСтатусов = Запрос.Выполнить().Выгрузить();
	НаборСтатусов = ТЗНаборСтатусов.ВыгрузитьКолонку("Статус");

	Элементы.ОтборОбщийСтатусОбработкиОбъявления.СписокВыбора.ЗагрузитьЗначения(НаборСтатусов);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборРавно(Элементы.Профиль);
	УстановитьОтборРавно(Элементы.Менеджер);
	УстановитьОтборРавно(Элементы.СтатусРазмещенияНаСайте);
	УстановитьОтборРавно(Элементы.ОбщийСтатусОбработкиОбъявления);
	УстановитьОтборПоУправление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УправлениеПриИзменении(Элемент)
	УстановитьОтборПоУправление();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборРавно(Элемент)

	ИмяПоля = СтрЗаменить(Элемент.Имя, "Отбор", "");
	ПравоеЗначение = ЭтаФорма[ИмяПоля];
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			ИмяПоля,
																			ПравоеЗначение,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ПравоеЗначение));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОбъявления(Команда)

	Если ЗначениеЗаполнено(Профиль) Тогда
		ДлительнаяОперация = НачатьОбновлениеОбъявлений(УникальныйИдентификатор, Профиль);

		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

		// Подключение обработчика завершения фонового задания.
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияОбъявлений", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработкаЗавершения, ПараметрыОжидания);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран профиль'"), , "ОтборПрофиль");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьАвтозагрузку(Команда)

	ПакетАвито = МП_АвитоВызовСервера.СформироватьФайлАвтозагрузкиПрофиля(Профиль);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ПакетАвито);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоУправление()

	ИспользоватьОтбор = Не (Управление = "Все" Или ПустаяСтрока(Управление));

	ВидСравненияДляСписка = ?(Управление = "Автозагрузка",
							  ВидСравненияКомпоновкиДанных.Заполнено,
							  ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Номенклатура",
																			ОбщийСтатусОбработкиОбъявления,
																			ВидСравненияДляСписка,
																			,
																			ИспользоватьОтбор);
КонецПроцедуры

#Область КомандаОбновитьОбъявления

&НаСервереБезКонтекста
Функция НачатьОбновлениеОбъявлений(УникальныйИдентификатор, Профиль)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
												"МП_АвитоВызовСервера.ОбновитьОбъявленияПрофиля",
												Профиль);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбновленияОбъявлений(Результат, ДополнительныеПараметры) Экспорт
	
	// Обновление списка объявлений
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.УдалитьМП_АвитоИдентификаторыОбъявлений"));
		
	// Пользователь отменил задание
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//	// Ошибка выполнения задания
	//	Если Результат.Статус = "Ошибка" Тогда
	////		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	//	КонецЕсли;
	//
	//	// Успешное выполнение обновления
	//	Если Результат.Статус = "Выполнено" Тогда
	//
	//		РезультатОбновления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	//		
	//		// Вывести результат обновления справочника
	//
	//	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
